Sysbench_PolarDB_Mysql5.7-8.0/Sysbench_Mysql5.7_log/8Core64G-3Nodes/202103102034/sysbench_read_write_3000.log
Time: 20210310204802, now running sysbench with thread of:  + 3000
Running command: sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --mysql-host=pc-0iw7xr702y48yl2c1.rwlb.japan.rds.aliyuncs.com --mysql-port=3306 --mysql-user=sbtest --mysql-password=Test1234 --mysql-db=sbtest --table-size=100000000 --tables=500 --events=0 --time=60 --db-ps-mode=disable --percentile=95 --report-interval=1 --threads=3000 run
sysbench 1.0.18-ab7d582 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 3000
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 3000 tps: 105.13 qps: 45638.45 (r/w/o: 40342.99/2294.20/3001.26) lat (ms,95%): 1032.01 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 3000 tps: 323.14 qps: 7496.17 (r/w/o: 4325.83/2525.07/645.27) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 3000 tps: 474.97 qps: 10570.30 (r/w/o: 6523.57/3094.80/951.94) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 3000 tps: 708.04 qps: 14770.74 (r/w/o: 10314.52/3041.15/1415.07) lat (ms,95%): 3982.86 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 3000 tps: 639.04 qps: 12191.82 (r/w/o: 8432.57/2481.17/1278.09) lat (ms,95%): 4943.53 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 3000 tps: 706.94 qps: 13618.86 (r/w/o: 9482.21/2723.77/1412.88) lat (ms,95%): 5918.87 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 3000 tps: 897.00 qps: 19000.06 (r/w/o: 13466.04/3739.01/1795.01) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 3000 tps: 715.00 qps: 13963.98 (r/w/o: 9866.98/2667.00/1430.00) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 3000 tps: 866.99 qps: 17179.83 (r/w/o: 12018.88/3427.97/1732.98) lat (ms,95%): 8484.79 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 3000 tps: 548.01 qps: 10786.28 (r/w/o: 7459.19/2235.06/1092.03) lat (ms,95%): 9284.15 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 3000 tps: 240.99 qps: 3241.91 (r/w/o: 1965.94/788.98/486.99) lat (ms,95%): 10531.32 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 3000 tps: 450.01 qps: 8324.15 (r/w/o: 5824.11/1600.03/900.02) lat (ms,95%): 11317.84 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 3000 tps: 440.01 qps: 9610.26 (r/w/o: 6826.19/1905.05/879.02) lat (ms,95%): 12163.09 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 3000 tps: 982.06 qps: 20516.32 (r/w/o: 14532.94/4018.26/1965.13) lat (ms,95%): 11732.86 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 3000 tps: 1192.98 qps: 24571.67 (r/w/o: 17369.77/4815.94/2385.97) lat (ms,95%): 9799.46 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 3000 tps: 875.06 qps: 17788.17 (r/w/o: 12442.82/3596.24/1749.11) lat (ms,95%): 9284.15 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 3000 tps: 518.02 qps: 10503.43 (r/w/o: 7446.31/2020.08/1037.04) lat (ms,95%): 12838.21 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 3000 tps: 351.99 qps: 7035.84 (r/w/o: 4906.89/1424.97/703.98) lat (ms,95%): 13550.80 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 3000 tps: 319.00 qps: 6455.97 (r/w/o: 4502.98/1314.99/638.00) lat (ms,95%): 14047.70 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 3000 tps: 298.00 qps: 5955.96 (r/w/o: 4114.97/1245.99/595.00) lat (ms,95%): 15371.13 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 3000 tps: 492.97 qps: 9851.41 (r/w/o: 6920.59/1944.88/985.94) lat (ms,95%): 14827.42 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 3000 tps: 280.03 qps: 5653.60 (r/w/o: 3958.42/1134.12/561.06) lat (ms,95%): 17124.84 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 3000 tps: 338.01 qps: 6755.12 (r/w/o: 4731.08/1348.02/676.01) lat (ms,95%): 16224.31 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 3000 tps: 457.98 qps: 9137.65 (r/w/o: 6401.75/1819.93/915.96) lat (ms,95%): 17752.80 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 3000 tps: 313.00 qps: 6210.00 (r/w/o: 4371.00/1213.00/626.00) lat (ms,95%): 19778.24 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 3000 tps: 476.99 qps: 9490.73 (r/w/o: 6682.81/1853.95/953.97) lat (ms,95%): 19425.29 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 3000 tps: 408.98 qps: 8160.52 (r/w/o: 5662.67/1680.90/816.95) lat (ms,95%): 18738.17 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 3000 tps: 387.03 qps: 7782.58 (r/w/o: 5482.41/1525.11/775.06) lat (ms,95%): 20876.04 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 3000 tps: 400.01 qps: 7963.16 (r/w/o: 5602.12/1561.03/800.02) lat (ms,95%): 21641.55 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 3000 tps: 456.99 qps: 9166.87 (r/w/o: 6411.91/1840.97/913.99) lat (ms,95%): 22842.77 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 3000 tps: 419.00 qps: 8357.91 (r/w/o: 5854.94/1664.98/837.99) lat (ms,95%): 22034.77 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 3000 tps: 432.01 qps: 8635.18 (r/w/o: 6015.13/1758.04/862.02) lat (ms,95%): 23680.40 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 3000 tps: 275.00 qps: 5538.92 (r/w/o: 3892.94/1093.98/551.99) lat (ms,95%): 24548.75 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 3000 tps: 429.02 qps: 8498.32 (r/w/o: 5905.22/1736.07/857.03) lat (ms,95%): 24110.66 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 3000 tps: 348.00 qps: 7030.03 (r/w/o: 4898.02/1435.01/697.00) lat (ms,95%): 22842.77 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 3000 tps: 487.96 qps: 9828.18 (r/w/o: 6907.43/1944.84/975.92) lat (ms,95%): 24110.66 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 3000 tps: 357.01 qps: 7134.13 (r/w/o: 4987.09/1433.03/714.01) lat (ms,95%): 24994.79 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 3000 tps: 294.99 qps: 5904.86 (r/w/o: 4135.90/1178.97/589.99) lat (ms,95%): 24110.66 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 3000 tps: 306.01 qps: 6205.22 (r/w/o: 4272.15/1321.05/612.02) lat (ms,95%): 27349.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 3000 tps: 487.01 qps: 9748.11 (r/w/o: 6828.08/1946.02/974.01) lat (ms,95%): 28352.44 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 3000 tps: 355.02 qps: 7096.31 (r/w/o: 4977.22/1409.06/710.03) lat (ms,95%): 26382.13 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 3000 tps: 387.97 qps: 7777.48 (r/w/o: 5423.64/1577.89/775.95) lat (ms,95%): 29392.11 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 3000 tps: 319.98 qps: 6375.57 (r/w/o: 4459.70/1275.91/639.96) lat (ms,95%): 29392.11 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 3000 tps: 441.02 qps: 8751.42 (r/w/o: 6133.29/1736.08/882.04) lat (ms,95%): 29926.15 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 3000 tps: 519.01 qps: 10491.22 (r/w/o: 7335.15/2118.04/1038.02) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 3000 tps: 330.00 qps: 6636.06 (r/w/o: 4620.04/1356.01/660.01) lat (ms,95%): 31587.21 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 3000 tps: 314.00 qps: 6250.04 (r/w/o: 4396.03/1226.01/628.00) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 3000 tps: 398.01 qps: 7846.22 (r/w/o: 5461.15/1589.05/796.02) lat (ms,95%): 33340.46 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 3000 tps: 459.98 qps: 9351.50 (r/w/o: 6549.65/1881.90/919.95) lat (ms,95%): 33340.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 3000 tps: 549.02 qps: 10918.43 (r/w/o: 7652.30/2168.09/1098.04) lat (ms,95%): 33340.46 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 3000 tps: 301.00 qps: 6090.94 (r/w/o: 4248.96/1239.99/601.99) lat (ms,95%): 35191.04 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 3000 tps: 387.00 qps: 7720.03 (r/w/o: 5382.02/1564.01/774.00) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 3000 tps: 560.99 qps: 11232.78 (r/w/o: 7871.84/2238.96/1121.98) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 3000 tps: 354.99 qps: 7207.77 (r/w/o: 4984.84/1512.95/709.98) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 3000 tps: 433.01 qps: 8599.26 (r/w/o: 6053.18/1680.05/866.03) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 3000 tps: 425.01 qps: 8386.12 (r/w/o: 5871.08/1666.02/849.01) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 3000 tps: 539.01 qps: 10919.28 (r/w/o: 7597.19/2243.06/1079.03) lat (ms,95%): 35830.44 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 3000 tps: 344.00 qps: 6860.95 (r/w/o: 4840.97/1331.99/688.00) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 3000 tps: 415.99 qps: 8276.85 (r/w/o: 5791.89/1652.97/831.98) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 3000 tps: 287.98 qps: 5800.69 (r/w/o: 4078.78/1145.94/575.97) lat (ms,95%): 31023.52 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 3000 tps: 548.99 qps: 10750.81 (r/w/o: 7489.87/2162.96/1097.98) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 3000 tps: 402.05 qps: 8248.97 (r/w/o: 5819.69/1625.19/804.09) lat (ms,95%): 33946.25 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 3000 tps: 436.99 qps: 8705.84 (r/w/o: 6081.88/1749.97/873.98) lat (ms,95%): 29392.11 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 3000 tps: 466.97 qps: 9346.34 (r/w/o: 6556.53/1855.87/933.93) lat (ms,95%): 37144.33 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 3000 tps: 374.01 qps: 7479.29 (r/w/o: 5247.21/1484.06/748.03) lat (ms,95%): 25911.33 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 3000 tps: 420.01 qps: 8386.13 (r/w/o: 5882.09/1664.03/840.01) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 3000 tps: 374.97 qps: 7453.45 (r/w/o: 5202.62/1500.89/749.94) lat (ms,95%): 29926.15 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 3000 tps: 384.03 qps: 7707.61 (r/w/o: 5431.43/1508.12/768.06) lat (ms,95%): 27846.48 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 3000 tps: 494.96 qps: 9739.18 (r/w/o: 6829.42/1920.84/988.92) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 3000 tps: 476.03 qps: 9584.59 (r/w/o: 6722.41/1909.12/953.06) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 3000 tps: 455.00 qps: 9071.00 (r/w/o: 6372.00/1791.00/908.00) lat (ms,95%): 29392.11 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 3000 tps: 420.00 qps: 8482.99 (r/w/o: 5915.99/1725.00/842.00) lat (ms,95%): 31023.52 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 3000 tps: 618.97 qps: 12339.49 (r/w/o: 8670.64/2430.90/1237.95) lat (ms,95%): 31023.52 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 3000 tps: 473.05 qps: 9313.89 (r/w/o: 6508.62/1861.18/944.09) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 3000 tps: 382.02 qps: 7709.33 (r/w/o: 5444.23/1499.06/766.03) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 3000 tps: 330.96 qps: 6684.09 (r/w/o: 4651.37/1370.81/661.91) lat (ms,95%): 28352.44 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 3000 tps: 444.03 qps: 8894.64 (r/w/o: 6204.44/1802.13/888.06) lat (ms,95%): 34563.04 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 3000 tps: 340.00 qps: 6690.01 (r/w/o: 4720.01/1291.00/679.00) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 3000 tps: 341.98 qps: 6894.67 (r/w/o: 4836.77/1372.93/684.97) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 3000 tps: 424.00 qps: 8494.00 (r/w/o: 5929.00/1717.00/848.00) lat (ms,95%): 34563.04 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 3000 tps: 509.00 qps: 9921.96 (r/w/o: 6929.98/1973.99/1018.00) lat (ms,95%): 28867.59 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 3000 tps: 464.04 qps: 9481.90 (r/w/o: 6668.63/1885.18/928.09) lat (ms,95%): 28867.59 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 3000 tps: 476.93 qps: 9529.64 (r/w/o: 6700.04/1875.73/953.86) lat (ms,95%): 28867.59 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 3000 tps: 431.02 qps: 8639.40 (r/w/o: 6039.28/1738.08/862.04) lat (ms,95%): 29926.15 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 3000 tps: 424.02 qps: 8475.47 (r/w/o: 5927.33/1700.09/848.05) lat (ms,95%): 26861.48 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 3000 tps: 411.00 qps: 8285.02 (r/w/o: 5769.01/1694.00/822.00) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 3000 tps: 436.98 qps: 8745.54 (r/w/o: 6117.68/1753.91/873.95) lat (ms,95%): 34563.04 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 3000 tps: 462.99 qps: 9215.81 (r/w/o: 6478.87/1810.96/925.98) lat (ms,95%): 31023.52 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 3000 tps: 547.00 qps: 10805.95 (r/w/o: 7547.96/2163.99/1093.99) lat (ms,95%): 33946.25 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 3000 tps: 453.01 qps: 9201.24 (r/w/o: 6454.17/1841.05/906.02) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 3000 tps: 462.06 qps: 8991.09 (r/w/o: 6264.76/1802.22/924.11) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 3000 tps: 376.89 qps: 7754.71 (r/w/o: 5468.39/1532.55/753.78) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 3000 tps: 307.03 qps: 6064.60 (r/w/o: 4266.42/1184.12/614.06) lat (ms,95%): 35830.44 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 3000 tps: 374.04 qps: 7527.72 (r/w/o: 5273.51/1506.14/748.07) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 3000 tps: 369.98 qps: 7502.52 (r/w/o: 5187.67/1574.90/739.95) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 3000 tps: 447.02 qps: 8949.47 (r/w/o: 6258.33/1797.09/894.05) lat (ms,95%): 29392.11 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 3000 tps: 387.96 qps: 7781.20 (r/w/o: 5427.45/1577.84/775.92) lat (ms,95%): 26861.48 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 3000 tps: 412.03 qps: 8145.52 (r/w/o: 5728.37/1593.10/824.05) lat (ms,95%): 33946.25 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 3000 tps: 405.01 qps: 8119.25 (r/w/o: 5682.17/1627.05/810.02) lat (ms,95%): 35830.44 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 3000 tps: 564.96 qps: 11354.24 (r/w/o: 7921.47/2302.85/1129.92) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 3000 tps: 417.04 qps: 8329.89 (r/w/o: 5858.62/1637.17/834.09) lat (ms,95%): 31023.52 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 3000 tps: 375.00 qps: 7477.99 (r/w/o: 5205.99/1522.00/750.00) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 3000 tps: 428.95 qps: 8598.95 (r/w/o: 6043.26/1697.79/857.89) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 3000 tps: 454.04 qps: 9097.88 (r/w/o: 6349.61/1840.18/908.09) lat (ms,95%): 29926.15 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 3000 tps: 453.97 qps: 9112.47 (r/w/o: 6364.63/1839.89/907.95) lat (ms,95%): 31587.21 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 3000 tps: 514.01 qps: 10253.11 (r/w/o: 7197.08/2028.02/1028.01) lat (ms,95%): 31587.21 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 3000 tps: 348.00 qps: 6927.01 (r/w/o: 4844.01/1387.00/696.00) lat (ms,95%): 29392.11 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 3000 tps: 425.00 qps: 8516.05 (r/w/o: 5981.03/1685.01/850.00) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 3000 tps: 338.04 qps: 6719.80 (r/w/o: 4715.56/1328.16/676.08) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 3000 tps: 573.96 qps: 11481.18 (r/w/o: 8012.43/2320.84/1147.92) lat (ms,95%): 33340.46 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 3000 tps: 391.00 qps: 7826.92 (r/w/o: 5513.94/1530.98/781.99) lat (ms,95%): 31023.52 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 3000 tps: 376.98 qps: 7423.55 (r/w/o: 5170.69/1499.91/752.95) lat (ms,95%): 33946.25 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 3000 tps: 447.02 qps: 9070.46 (r/w/o: 6341.32/1834.09/895.05) lat (ms,95%): 28352.44 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 3000 tps: 390.02 qps: 7793.44 (r/w/o: 5473.31/1540.09/780.04) lat (ms,95%): 31023.52 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 3000 tps: 270.97 qps: 5367.45 (r/w/o: 3775.61/1049.89/541.94) lat (ms,95%): 27349.55 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 3000 tps: 446.04 qps: 8798.84 (r/w/o: 6089.58/1819.17/890.09) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 3000 tps: 350.96 qps: 7263.07 (r/w/o: 5097.35/1461.81/703.91) lat (ms,95%): 27846.48 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 3000 tps: 422.05 qps: 8451.07 (r/w/o: 5900.74/1706.22/844.11) lat (ms,95%): 30469.90 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 3000 tps: 449.98 qps: 9021.60 (r/w/o: 6307.72/1813.92/899.96) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 3000 tps: 377.02 qps: 7208.46 (r/w/o: 4984.32/1491.10/733.05) lat (ms,95%): 28352.44 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 3000 tps: 209.99 qps: 815.97 (r/w/o: 0.00/605.98/209.99) lat (ms,95%): 42899.63 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 3000 tps: 179.96 qps: 650.86 (r/w/o: 0.00/470.90/179.96) lat (ms,95%): 35191.04 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 3000 tps: 190.02 qps: 730.09 (r/w/o: 0.00/540.07/190.02) lat (ms,95%): 41382.17 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 3000 tps: 175.01 qps: 657.04 (r/w/o: 0.00/482.03/175.01) lat (ms,95%): 46103.52 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3000 tps: 219.97 qps: 768.90 (r/w/o: 0.00/548.93/219.97) lat (ms,95%): 48662.51 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 3000 tps: 282.04 qps: 1003.13 (r/w/o: 0.00/721.09/282.04) lat (ms,95%): 46941.21 err/s: 0.00 reconn/s: 0.00
[ 127s ] thds: 3000 tps: 210.01 qps: 740.05 (r/w/o: 0.00/530.04/210.01) lat (ms,95%): 43679.10 err/s: 0.00 reconn/s: 0.00
[ 128s ] thds: 3000 tps: 267.98 qps: 912.94 (r/w/o: 0.00/644.96/267.98) lat (ms,95%): 49546.69 err/s: 0.00 reconn/s: 0.00
[ 129s ] thds: 3000 tps: 413.94 qps: 1387.82 (r/w/o: 0.00/973.87/413.94) lat (ms,95%): 42134.07 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3000 tps: 728.05 qps: 2366.17 (r/w/o: 0.00/1636.12/730.05) lat (ms,95%): 46103.52 err/s: 0.00 reconn/s: 0.00
[ 131s ] thds: 2998 tps: 41.99 qps: 133.98 (r/w/o: 0.00/92.99/40.99) lat (ms,95%): 29926.15 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 2998 tps: 44.01 qps: 141.03 (r/w/o: 0.00/98.02/43.01) lat (ms,95%): 39918.39 err/s: 0.00 reconn/s: 0.00
[ 133s ] thds: 2988 tps: 14.00 qps: 43.99 (r/w/o: 0.00/30.00/14.00) lat (ms,95%): 32161.14 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            786688
        write:                           224768
        other:                           112384
        total:                           1123840
    transactions:                        56192  (420.83 per sec.)
    queries:                             1123840 (8416.60 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          133.5242s
    total number of events:              56192

Latency (ms):
         min:                                   10.77
         avg:                                 6744.54
         max:                                97545.53
         95th percentile:                    28867.59
         sum:                            378989020.89

Threads fairness:
    events (avg/stddev):           18.7307/6.43
    execution time (avg/stddev):   126.3297/3.11